IDENTIFICATION DIVISION.
PROGRAM-ID. LAB5SUB.
ENVIRONMENT DIVISION.
DATA DIVISION.
LINKAGE SECTION.
FD IN-FILE LABEL RECORD IS STANDARD.
01 IN-RECORD.
  02 IA PIC 9(6).
  02 IB PIC X(12).
  02 IC PIC 99V99.
  02 ID PIC 99V99.
  02 IE PIC 99V99.
  02 IF PIC X(50).
FD OUT-FILE LABEL RECORD IS STANDARD.
01 OUT-RECORD.
  02 OA PIC 9(6).
  02 OB PIC X(12).
  02 OC PIC 99V99.
  02 OD PIC 99V99.
  02 OE PIC 99V99.
  02 OF PIC X(50).
WORKING-STORAGE SECTION.
77 TEMP PIC 999V99.
77 TEMP1 PIC 99V99.
77 IDX1 PIC 9.
PROCEDURE DIVISION USING IA, IB, IC, ID, IE, IF, OA, OB, OC, OD, OE, OF.
     OPEN INPUT IN-FILE.
     OPEN OUTPUT OUT-FILE.

     PERFORM A VARYING IDX1 FROM 1 BY 1 UNTIL IDX1 > 3.
     CLOSE IN-FILE.
     CLOSE OUT-FILE.
     GOBACK.
A.READ IN FILE AT END STOP RUN.
  MOVE IA TO OA.
  MOVE IB TO OB.
  MOVE IC TO OC.
  MOVE ID TO OD.
  MOVE IE TO OE.
  ADD IC , ID , IE GIVING TEMP.
  DIVIDE 3 INTO TEMP GIVING TEMP1 ROUNDED.
  MOVE TEMP1 TO OF.
  WRITE OUT-RECORD.

