IDENTIFICATION DIVISION.
PROGRAM-ID    LABFIVE.
ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT IN-FILE ASSIGN TO FILEIN.
    SELECT OUT-FILE ASSIGN TO FILEOUT.
DATA DIVISION.
FILE SECTION.
FD IN-FILE LABEL RECORD IS STANDARD.
01 IN-RECORD.
  02 I1 PIC 9(6).
  02 I2 PIC X(12).
  02 I3 PIC 99V99.
  02 I4 PIC 99V99.
  02 I5 PIC 99V99.
  02 I6 PIC X(50).
FD OUT-FILE LABEL RECORD IS STANDARD.
01 OUT-RECORD.
  02 O1 PIC 9(6).
  02 S1 PIC XX.
  02 O2 PIC X(12).
  02 S2 PIC XX.
  02 O3 PIC 99.99.
  02 S3 PIC XX.
  02 O4 PIC 99.99.
  02 S4 PIC XX.
  02 O5 PIC 99.99.
  02 S5 PIC XX.
  02 O6 PIC 99.99.
  02 O7 PIC X(32).
PROCEDURE DIVISION.  
    CALL 'lab5sub' USING I1, I2, I3, I4, I5, I6, O1, O2, O3, O4, O5, O6.
    STOP RUN.
  

