//ST054AB JOB ACCT#,TANGF,MSGLEVEL=(1,1),NOTIFY=TANGF  
//STEP1 EXEC PROC=IGYWCL                               
//COBOL.SYSIN DD DSN=ST054.COBOL.SOURCE(lab5sub),DISP=SHR  
//LKED.SYSLMOD DD DSN=ST054.LOADLIB(SUB1) ,DISP=SHR
