//TANGFAB JOB ACCT#,TANGF,MSGLEVEL=(1,1),NOTIFY=TANGF  
//STEP EXEC PROC=IGYWCL
//COBOL.SYSIN DD DSN=ST054.COBOL.SOURCE(lab5),DISP=SHR
//LKED.SYSLMOD DD DSNAME=ST054.TEST.LOAD(lab5),DISP=SHR
//LKED.SYSLMOD DD DSN=ST054.TEST.LOAD,DISP=SHR
//LKED.SYSIN DD*
   INCLUDE RUNLIB(lab5sub)
