IDENTIFICATION DIVISION.
PROGRAM-ID    LABSIX2.
ENVIRONMENT DIVISION.
DATA DIVISION.
FILE SECTION.
FD INN LABEL RECORD IS STANDARD.
READ INN.
SET N TO 1.
SEARCH STUDENT AT END DISPLAY 'NUN NOT FOUND'.
WHEN NUM1(N)='ST054'
 MOVE 'LI ZHIBO' TO NAME1(N).
 MOVE '100' TO COURSE1(N).
ELSE
 DISPLAY 'NUM NOT FOUND'.
PERFORM C UNTIL A>200.
END PERFORM.
STOP RUN.
C. MOVE NUM1(X) TO NUM2.
   MOVE NAME1(X) TO NAME2.
   MOVE COURSE1(X) TO COURSE2.
   WRITE OUT2-RECORD.

