IDENTIFICATION DIVISION.
PROGRAM-ID LABSIX.
ENVIRONMENT DIVISION.
DATA DIVISION.
FILE SECTION.
FD OUT1 LABEL RECORD IS STANDDARD.
01 OUT1-RACORD.
  02 STUDENT OCCURS 200 TIMES INDEXD BY N.
    03 NUM1 PIC X(5).
    03 NAME1 PIC X(13).
    03 COURSE1 PIC 9(3)B.
WORKING-STORAGE SECTION.
77 A PIC 999.
77 TEMP PIC 999.
77 TEMP1 PIC X(2).
77 TEMP2 PIC X(5).
PERFORM RR VARYING A FROM 1 BY 1  UNTIL A>200.
A. MOVE A TO TEMP.
   STRING
    TEMP1 DELIMITED BY SPACE '' DELIMITED BY SIZE TEMP DELIMITED BY SPACE INTO TEMP1.
   MOVE ALL('0') TO NAME1.
   MOVE ALL('0') TO COURSE1.
END PERFORM.
 WRITE OUT1-RECORD.
 STOP RUN.
   
